"use client";

import React from "react";
import Accordion from "./Accordion";

const AccordionContainer = () => {
  const accordionItems = [
    {
      title: "چگونه در سایت ثبت نام کنیم؟",
      desc: "لورم ایپسوم یک متن فرضی است که در متن های داینامیک استفاده میشود. لورم ایپسوم یک متن فرضی است که در متن های داینامیک استفاده میشود.",
    },
    {
      title: "چگونه دستگاه خود را ثبت کنیم",
      desc: "لورم ایپسوم یک متن فرضی است که در متن های داینامیک استفاده میشود. لورم ایپسوم یک متن فرضی است که در متن های داینامیک استفاده میشود.",
    },
    {
      title: "چگونه وارد سایت شویم",
      desc: "لورم ایپسوم یک متن فرضی است که در متن های داینامیک استفاده میشود. لورم ایپسوم یک متن فرضی است که در متن های داینامیک استفاده میشود.",
    },
    {
      title: "چگونه با ارتباط برقرار کنید",
      desc: "لورم ایپسوم یک متن فرضی است که در متن های داینامیک استفاده میشود. لورم ایپسوم یک متن فرضی است که در متن های داینامیک استفاده میشود.",
    },
  ];
  return (
    <div className="w-full grid gap-3 grid-cols-1">
      {accordionItems.map((item) => (
        <Accordion title={item.title} desc={item.desc} />
      ))}
    </div>
  );
};

export default AccordionContainer;
