"use client";

import React from "react";
import Accordion from "./Accordion";

const AccordionContainer = () => {
  const accordionItems = [
    {
      title: "چگونه در سایت ثبت نام کنیم؟",
      desc: "شما می توانید در قسمت باللای صفحه بر روی دکمه حساب کاربری کلیک کرده و یک حساب کاربری ایجاد کنید.",
    },
    {
      title: "چگونه میتوانیم دستگاه تجهیزات ئزشکی خود را در سایت  ثبت کنیم؟",
      desc: "کاربر گرامی شما باید ابتدا در سایت ثبت نام کرده و سپس به بخش اطلاعات حساب کاربری رفته و اطلاعات خود را تکمیل کنید؛ سپس می توانید دستگاه خود را ثبت کنید.",
    },
    {
      title: "چگونه میتوانیم از کارشناس تجهیزات پزشکی مشاوره بگیریم؟",
      desc: "کاربر گرامی شما می توانید با مراجعه به صفحه کارشناس خرید تجهیزات پزشکی و با پر کردن فرم درخواست یک مشاوره را داشته باشید.",
    },
    {
      title: "بازار تجهیزات پزشکی چیست؟",
      desc: "ما در این سایت یک مرجع برای خرید و فروش ؛ معرفی تجهیزات پزشکی برای شرکت ها فراهم آورده اییم تا کاربران بتوانند به راحتی به خرید و فروش آن بپردازند.",
    },
  ];
  return (
    <div className="w-full grid gap-3 grid-cols-1">
      {accordionItems.map((item, index) => (
        <Accordion title={item.title} desc={item.desc} key={index} />
      ))}
    </div>
  );
};

export default AccordionContainer;
